vlm/base/Documents/бит_АктОБраке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_АктОБраке</Name>
			<Comment>ЛТ9.2</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_БракВозвратСрезкаПродукции</xr:Item>
				<xr:Item>InformationRegister.бит_ИсторияИзмененийСсогласованияАктовОБраке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыОБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СменноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменныйМастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияОбнаружения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ОперацияОбнаружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачатоСогласование</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступностьФормы</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиСтатуса</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииСтатуса</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыОБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УспешностьСогласования</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКУдержаниюВосстановление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКУдержаниюОтходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКУдержаниюПеремаркировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийУщербКУдержанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОБраке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНесоответствия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыНесоответствия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Восстановление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Виновник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрямыеЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьВозможногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлановоУчетная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозможногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КУдержанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Восстановление</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыОперацийВосстановления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричиныБрака</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаБрака</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныБрака</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Перемаркировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураЗабракованная</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПеремаркированоВ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолнаяСебестоимостьЗабракованнойНоменклатуры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолнаяСебестоимостьПеремаркированнойНоменклатуры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КУдержанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/base/Enums/бит_СтатусыОБраке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_СтатусыОБраке</Name>
			<Comment>ЛТ9.5</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктСформированСК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформленМастером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненРасчетМатериаловТехнолог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненРасчетНормировщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованНачальникомЦеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформленБухгалтером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассмотренНаКомиссии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/base/Documents/бит_АктОБраке/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	УстановитьУсловноеОформление();
	
	ОбновитьДанныеФормы();
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры
 
  
&НаСервере 
Процедура УстановитьУсловноеОформление()
    //Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
 	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше; 
	ЭлементОтбора.ПравоеЗначение = ТекущаяДатаСеанса() - 864000; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
    
	Для каждого элПоля Из Элементы.Список.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;
	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.бит_Статус");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Перечисления.бит_СтатусыОБраке.РассмотренНаКомиссии; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый); 
    
	Для каждого элПоля Из Элементы.Список.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле1 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле1.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;
	
	Попытка
		Элементы.СписокКонтекстноеМенюСкопировать.Видимость   = Ложь;
		Элементы.СписокКонтекстноеМенюСкопировать.Доступность = Ложь;
		Элементы.ФормаСкопировать.Видимость                   = Ложь;
		Элементы.ФормаСкопировать.Доступность                 = Ложь;
	Исключение
	КонецПопытки;
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры


&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"Статус",
		Статус,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(Статус));

КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"Участок",
		Участок,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(Участок));

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +	
	ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", НачалоПериода, КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения); 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, РезультатВыбора, "НачалоПериода, КонецПериода");
	
	ОбновитьДанныеФормы();
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры     

&НаСервере
Процедура ОбновитьДанныеФормы()
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	ДинамическиеСписки = Новый Массив;
	ДинамическиеСписки.Добавить("Список");
		
	Для каждого Имя Из ДинамическиеСписки Цикл
		
		ЭлементыОтбора = ОбщегоНазначенияУТКлиентСервер.ПолучитьОтборДинамическогоСписка(ЭтаФорма[Имя]).Элементы;
		
		ГруппаОтбораПериода = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			ЭлементыОтбора, "ГруппаОтбораПериода", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
							
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЭтаФорма[Имя], 
			"Статус", 
			Статус, 
			ВидСравненияКомпоновкиДанных.Равно
			,
			,
			ЗначениеЗаполнено(Статус));
			
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		//	ЭтаФорма[Имя], 
		//	"Цех", 
		//	Цех, 
		//	ВидСравненияКомпоновкиДанных.Равно
		//	,
		//	,                           
		//	ЗначениеЗаполнено(Цех));
			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЭтаФорма[Имя], 
			"Участок", 
			Участок, 
			ВидСравненияКомпоновкиДанных.Равно
			,
			,
			ЗначениеЗаполнено(Участок));
			
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтбораПериода,
			"Дата", 
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно, 
			НачалоДня(НачалоПериода),
			,
			ЗначениеЗаполнено(НачалоПериода));
			
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтбораПериода,
			"Дата", 
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, 
			КонецДня(КонецПериода),
			,
			ЗначениеЗаполнено(КонецПериода));
	
	КонецЦикла;
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);  
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)  
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры  

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()    
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список); 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры                              							  

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 +
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Элементы.Список); 
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 -
	
КонецПроцедуры  

&НаКлиенте 
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 +
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 -
	
КонецПроцедуры
